Repository: Sage2vish/LXC-Build-Release-Manager
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: hi, pa

source: No metadata cache exists yet — every scan is already live, so this is a no-op today.
hi: अभी कोई मेटाडेटा कैश नहीं है — हर स्कैन पहले से ही सजीव है, इसलिए फ़िलहाल इसका कोई असर नहीं।
pa: ਅਜੇ ਕੋਈ ਮੈਟਾਡੇਟਾ ਕੈਸ਼ ਨਹੀਂ ਹੈ — ਹਰ ਸਕੈਨ ਪਹਿਲਾਂ ਤੋਂ ਹੀ ਲਾਈਵ ਹੈ, ਇਸ ਲਈ ਅੱਜ ਇਸਦਾ ਕੋਈ ਅਸਰ ਨਹੀਂ।

source: No parameters
hi: कोई पैरामीटर नहीं
pa: ਕੋਈ ਪੈਰਾਮੀਟਰ ਨਹੀਂ

source: No Repositories
hi: कोई रिपॉज़िटरी नहीं
pa: ਕੋਈ ਰਿਪੋਜ਼ਿਟਰੀ ਨਹੀਂ

source: No runnable scripts were found in /build/scripts/.
hi: /build/scripts/ में चलाने योग्य कोई स्क्रिप्ट नहीं मिली।
pa: /build/scripts/ ਵਿੱਚ ਚਲਾਉਣਯੋਗ ਕੋਈ ਸਕ੍ਰਿਪਟ ਨਹੀਂ ਮਿਲੀ।

source: No runs match these filters.
hi: इन फ़िल्टरों से कोई रन मेल नहीं खाता।
pa: ਇਹਨਾਂ ਫ਼ਿਲਟਰਾਂ ਨਾਲ ਕੋਈ ਰਨ ਮੇਲ ਨਹੀਂ ਖਾਂਦਾ।

source: No scripts found
hi: कोई स्क्रिप्ट नहीं मिली
pa: ਕੋਈ ਸਕ੍ਰਿਪਟ ਨਹੀਂ ਮਿਲੀ

source: No Shell Scripts Found
hi: कोई शेल स्क्रिप्ट नहीं मिली
pa: ਕੋਈ ਸ਼ੈੱਲ ਸਕ੍ਰਿਪਟ ਨਹੀਂ ਮਿਲੀ

source: None
hi: कोई नहीं
pa: ਕੋਈ ਨਹੀਂ

source: Not completed
hi: पूर्ण नहीं
pa: ਮੁਕੰਮਲ ਨਹੀਂ

source: Not selected
hi: चयनित नहीं
pa: ਚੁਣਿਆ ਨਹੀਂ

source: Not set
hi: सेट नहीं
pa: ਸੈੱਟ ਨਹੀਂ

source: Nothing matches “%@”.
hi: “%@” से कुछ भी मेल नहीं खाता।
pa: “%@” ਨਾਲ ਕੁਝ ਵੀ ਮੇਲ ਨਹੀਂ ਖਾਂਦਾ।

source: Nothing with a .sh extension was found anywhere in this repository.
hi: इस रिपॉज़िटरी में कहीं भी .sh एक्सटेंशन वाली कोई फ़ाइल नहीं मिली।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਵਿੱਚ ਕਿਤੇ ਵੀ .sh ਐਕਸਟੈਂਸ਼ਨ ਵਾਲੀ ਕੋਈ ਫ਼ਾਈਲ ਨਹੀਂ ਮਿਲੀ।

source: Notifications
hi: सूचनाएँ
pa: ਸੂਚਨਾਵਾਂ

source: Notify only when Build Manager is not in focus
hi: केवल तब सूचित करें जब बिल्ड मैनेजर सामने न हो
pa: ਸਿਰਫ਼ ਉਦੋਂ ਸੂਚਿਤ ਕਰੋ ਜਦੋਂ ਬਿਲਡ ਮੈਨੇਜਰ ਸਾਹਮਣੇ ਨਾ ਹੋਵੇ

source: Notify when a build completes successfully.
hi: बिल्ड सफल होने पर सूचित करें।
pa: ਬਿਲਡ ਸਫਲਤਾਪੂਰਵਕ ਮੁਕੰਮਲ ਹੋਣ ਤੇ ਸੂਚਿਤ ਕਰੋ।

source: Notify when a build fails.
hi: बिल्ड विफल होने पर सूचित करें।
pa: ਬਿਲਡ ਅਸਫਲ ਹੋਣ ਤੇ ਸੂਚਿਤ ਕਰੋ।

source: Notify when a build is cancelled or stopped.
hi: बिल्ड रद्द या बंद होने पर सूचित करें।
pa: ਬਿਲਡ ਰੱਦ ਜਾਂ ਰੋਕਿਆ ਜਾਣ ਤੇ ਸੂਚਿਤ ਕਰੋ।

source: Notify when a build starts.
hi: बिल्ड शुरू होने पर सूचित करें।
pa: ਬਿਲਡ ਸ਼ੁਰੂ ਹੋਣ ਤੇ ਸੂਚਿਤ ਕਰੋ।

source: Notify when a long running build finishes.
hi: लंबा बिल्ड समाप्त होने पर सूचित करें।
pa: ਲੰਬੀ ਬਿਲਡ ਮੁਕੰਮਲ ਹੋਣ ਤੇ ਸੂਚਿਤ ਕਰੋ।

source: Number of repositories to keep in the Recent list.
hi: हाल की सूची में रखी जाने वाली रिपॉज़िटरी की संख्या।
pa: ਤਾਜ਼ਾ ਸੂਚੀ ਵਿੱਚ ਰੱਖੀਆਂ ਜਾਣ ਵਾਲੀਆਂ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਦੀ ਗਿਣਤੀ।

source: OK
hi: ठीक है
pa: ਠੀਕ ਹੈ

source: Oldest logs will be removed when limit is exceeded.
hi: सीमा पार होने पर सबसे पुराने लॉग हटा दिए जाएँगे।
pa: ਸੀਮਾ ਪਾਰ ਹੋਣ ਤੇ ਸਭ ਤੋਂ ਪੁਰਾਣੇ ਲੌਗ ਹਟਾ ਦਿੱਤੇ ਜਾਣਗੇ।

source: Open application preferences
hi: ऐप्लिकेशन प्राथमिकताएँ खोलें
pa: ਐਪਲੀਕੇਸ਼ਨ ਤਰਜੀਹਾਂ ਖੋਲ੍ਹੋ

source: Open Build Manager data directory
hi: बिल्ड मैनेजर डेटा डायरेक्टरी खोलें
pa: ਬਿਲਡ ਮੈਨੇਜਰ ਡੇਟਾ ਡਾਇਰੈਕਟਰੀ ਖੋਲ੍ਹੋ

source: Open document in the default editor
hi: दस्तावेज़ डिफ़ॉल्ट संपादक में खोलें
pa: ਦਸਤਾਵੇਜ਼ ਡਿਫ਼ਾਲਟ ਸੰਪਾਦਕ ਵਿੱਚ ਖੋਲ੍ਹੋ

source: Open File
hi: फ़ाइल खोलें
pa: ਫ਼ਾਈਲ ਖੋਲ੍ਹੋ

source: Open Folder
hi: फ़ोल्डर खोलें
pa: ਫ਼ੋਲਡਰ ਖੋਲ੍ਹੋ

source: Open in Editor
hi: संपादक में खोलें
pa: ਸੰਪਾਦਕ ਵਿੱਚ ਖੋਲ੍ਹੋ

source: Open in Separate Window
hi: अलग विंडो में खोलें
pa: ਵੱਖਰੀ ਵਿੰਡੋ ਵਿੱਚ ਖੋਲ੍ਹੋ

source: Open in Terminal
hi: टर्मिनल में खोलें
pa: ਟਰਮੀਨਲ ਵਿੱਚ ਖੋਲ੍ਹੋ

source: Open log in a separate window
hi: लॉग अलग विंडो में खोलें
pa: ਲੌਗ ਵੱਖਰੀ ਵਿੰਡੋ ਵਿੱਚ ਖੋਲ੍ਹੋ

source: Open Logs Folder
hi: लॉग फ़ोल्डर खोलें
pa: ਲੌਗ ਫ਼ੋਲਡਰ ਖੋਲ੍ਹੋ

source: Open projects.json
hi: projects.json खोलें
pa: projects.json ਖੋਲ੍ਹੋ

source: Open Repository
hi: रिपॉज़िटरी खोलें
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਖੋਲ੍ਹੋ

source: Open Repository…
hi: रिपॉज़िटरी खोलें…
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਖੋਲ੍ਹੋ…

source: Open the folder where Build Manager stores its data.
hi: वह फ़ोल्डर खोलें जहाँ बिल्ड मैनेजर अपना डेटा रखता है।
pa: ਉਹ ਫ਼ੋਲਡਰ ਖੋਲ੍ਹੋ ਜਿੱਥੇ ਬਿਲਡ ਮੈਨੇਜਰ ਆਪਣਾ ਡੇਟਾ ਰੱਖਦਾ ਹੈ।

source: Open the last repository you were working with.
hi: वह रिपॉज़िटरी खोलें जिस पर आप काम कर रहे थे।
pa: ਉਹ ਰਿਪੋਜ਼ਿਟਰੀ ਖੋਲ੍ਹੋ ਜਿਸ ਤੇ ਤੁਸੀਂ ਕੰਮ ਕਰ ਰਹੇ ਸੀ।

source: Open the projects.json config template in your default editor.
hi: projects.json कॉन्फ़िग टेम्पलेट अपने डिफ़ॉल्ट संपादक में खोलें।
pa: projects.json ਕੌਨਫ਼ਿਗ ਟੈਮਪਲੇਟ ਆਪਣੇ ਡਿਫ਼ਾਲਟ ਸੰਪਾਦਕ ਵਿੱਚ ਖੋਲ੍ਹੋ।

source: Opened %@
hi: %@ को खोला गया
pa: %@ ਖੋਲ੍ਹਿਆ ਗਿਆ

source: Opens this repository's build/logs folder in Finder.
hi: इस रिपॉज़िटरी का build/logs फ़ोल्डर Finder में खोलता है।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਦਾ build/logs ਫ਼ੋਲਡਰ Finder ਵਿੱਚ ਖੋਲ੍ਹਦਾ ਹੈ।

source: Opens this run's log.
hi: इस रन का लॉग खोलता है।
pa: ਇਸ ਰਨ ਦਾ ਲੌਗ ਖੋਲ੍ਹਦਾ ਹੈ।

source: Output from the most recent build
hi: सबसे हाल के बिल्ड का आउटपुट
pa: ਸਭ ਤੋਂ ਤਾਜ਼ੀ ਬਿਲਡ ਦਾ ਆਉਟਪੁੱਟ

source: Outside
hi: बाहर
pa: ਬਾਹਰ

source: Outside repository
hi: रिपॉज़िटरी के बाहर
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਤੋਂ ਬਾਹਰ

source: Overall application behaviour.
hi: समग्र ऐप्लिकेशन व्यवहार।
pa: ਸਮੁੱਚਾ ਐਪਲੀਕੇਸ਼ਨ ਵਿਹਾਰ।

source: Overview
hi: अवलोकन
pa: ਸੰਖੇਪ

source: Parameters
hi: पैरामीटर
pa: ਪੈਰਾਮੀਟਰ

source: Personal access token
hi: व्यक्तिगत एक्सेस टोकन
pa: ਨਿੱਜੀ ਐਕਸੈੱਸ ਟੋਕਨ

source: Pin
hi: पिन करें
pa: ਪਿੰਨ ਕਰੋ

source: Pinned
hi: पिन किया गया
pa: ਪਿੰਨ ਕੀਤਾ

source: Platform
hi: प्लेटफ़ॉर्म
pa: ਪਲੇਟਫ਼ਾਰਮ

source: Play a system sound with notifications.
hi: सूचनाओं के साथ सिस्टम ध्वनि बजाएँ।
pa: ਸੂਚਨਾਵਾਂ ਨਾਲ ਸਿਸਟਮ ਆਵਾਜ਼ ਵਜਾਓ।

source: Play sound
hi: ध्वनि बजाएँ
pa: ਆਵਾਜ਼ ਵਜਾਓ

source: Point to a local folder or paste a GitHub repository URL.
hi: कोई स्थानीय फ़ोल्डर चुनें या GitHub रिपॉज़िटरी का URL चिपकाएँ।
pa: ਕੋਈ ਸਥਾਨਕ ਫ਼ੋਲਡਰ ਚੁਣੋ ਜਾਂ GitHub ਰਿਪੋਜ਼ਿਟਰੀ URL ਪੇਸਟ ਕਰੋ।

source: Preferences
hi: प्राथमिकताएँ
pa: ਤਰਜੀਹਾਂ

source: Preserve partial output on cancellation
hi: रद्द होने पर आंशिक आउटपुट सुरक्षित रखें
pa: ਰੱਦ ਕਰਨ ਤੇ ਅੰਸ਼ਕ ਆਉਟਪੁੱਟ ਸੁਰੱਖਿਅਤ ਰੱਖੋ

source: Prevent accidental quit when a build process is active.
hi: बिल्ड प्रक्रिया सक्रिय होने पर अनजाने में बंद होने से रोकें।
pa: ਬਿਲਡ ਪ੍ਰਕਿਰਿਆ ਸਰਗਰਮ ਹੋਣ ਤੇ ਅਣਜਾਣੇ ਵਿੱਚ ਬੰਦ ਹੋਣ ਤੋਂ ਰੋਕੋ।

source: Prevent macOS sleep while a build is running
hi: बिल्ड चलते समय macOS को सोने से रोकें
pa: ਬਿਲਡ ਚੱਲਦੇ ਸਮੇਂ macOS ਨੂੰ ਸੌਣ ਤੋਂ ਰੋਕੋ

source: Previous match
hi: पिछला मिलान
pa: ਪਿਛਲਾ ਮੇਲ

source: Quick Actions
hi: त्वरित क्रियाएँ
pa: ਤੁਰੰਤ ਕਾਰਵਾਈਆਂ

source: Re-open the repositories that were open in the previous session.
hi: पिछले सत्र में खुली रिपॉज़िटरी फिर से खोलें।
pa: ਪਿਛਲੇ ਸੈਸ਼ਨ ਵਿੱਚ ਖੁੱਲੀਆਂ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਦੁਬਾਰਾ ਖੋਲ੍ਹੋ।

source: Recent repositories
hi: हाल की रिपॉज़िटरी
pa: ਤਾਜ਼ਾ ਰਿਪੋਜ਼ਿਟਰੀਆਂ

source: Recent Repositories
hi: हाल की रिपॉज़िटरी
pa: ਤਾਜ਼ਾ ਰਿਪੋਜ਼ਿਟਰੀਆਂ

source: Record the GitHub URL this local folder was cloned from. It appears under the repository name at the top of this screen.
hi: वह GitHub URL दर्ज करें जहाँ से यह स्थानीय फ़ोल्डर क्लोन किया गया था। यह इस स्क्रीन के ऊपर रिपॉज़िटरी नाम के नीचे दिखता है।
pa: ਉਹ GitHub URL ਦਰਜ ਕਰੋ ਜਿੱਥੋਂ ਇਹ ਸਥਾਨਕ ਫ਼ੋਲਡਰ ਕਲੋਨ ਕੀਤਾ ਗਿਆ ਸੀ। ਇਹ ਇਸ ਸਕ੍ਰੀਨ ਦੇ ਸਿਖਰ ਤੇ ਰਿਪੋਜ਼ਿਟਰੀ ਨਾਮ ਦੇ ਹੇਠਾਂ ਦਿਖਦਾ ਹੈ।

source: Reduce transparency
hi: पारदर्शिता कम करें
pa: ਪਾਰਦਰਸ਼ਿਤਾ ਘਟਾਓ

source: Refresh build scripts
hi: बिल्ड स्क्रिप्ट ताज़ा करें
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਤਾਜ਼ਾ ਕਰੋ

source: Refresh Scripts
hi: स्क्रिप्ट रीफ़्रेश करें
pa: ਸਕ੍ਰਿਪਟਾਂ ਤਾਜ਼ਾ ਕਰੋ

source: Relative path where build logs are stored.
hi: वह सापेक्ष पथ जहाँ बिल्ड लॉग रखे जाते हैं।
pa: ਉਹ ਸੰਬੰਧਿਤ ਰਸਤਾ ਜਿੱਥੇ ਬਿਲਡ ਲੌਗ ਰੱਖੇ ਜਾਂਦੇ ਹਨ।

source: Relative path where build scripts are located.
hi: वह सापेक्ष पथ जहाँ बिल्ड स्क्रिप्ट होती हैं।
pa: ਉਹ ਸੰਬੰਧਿਤ ਰਸਤਾ ਜਿੱਥੇ ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਹਨ।

source: Remember recent repositories
hi: हाल की रिपॉज़िटरी याद रखें
pa: ਤਾਜ਼ਾ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਯਾਦ ਰੱਖੋ

source: Remote only
hi: केवल दूरस्थ
pa: ਸਿਰਫ਼ ਦੂਰ-ਦੁਰਾਡਾ

source: Remove
hi: हटाएँ
pa: ਹਟਾਓ

source: Remove %@ from the list?
hi: %@ को सूची से हटाएँ?
pa: %@ ਨੂੰ ਸੂਚੀ ਤੋਂ ਹਟਾਓ?

source: Remove all build history from this machine.
hi: इस मशीन से सारा बिल्ड इतिहास हटाएँ।
pa: ਇਸ ਮਸ਼ੀਨ ਤੋਂ ਸਾਰਾ ਬਿਲਡ ਇਤਿਹਾਸ ਹਟਾਓ।

source: Remove from List
hi: सूची से हटाएँ
pa: ਸੂਚੀ ਤੋਂ ਹਟਾਓ

source: Removes %@ recorded runs for this repository. Log files on disk are not deleted, and no other repository is affected.
hi: इस रिपॉज़िटरी के %@ दर्ज रन हटाता है। डिस्क पर लॉग फ़ाइलें नहीं हटाई जातीं, और कोई अन्य रिपॉज़िटरी प्रभावित नहीं होती।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਲਈ %@ ਦਰਜ ਰਨ ਹਟਾਉਂਦਾ ਹੈ। ਡਿਸਕ ਤੇ ਲੌਗ ਫ਼ਾਈਲਾਂ ਨਹੀਂ ਮਿਟਾਈਆਂ ਜਾਂਦੀਆਂ, ਅਤੇ ਕੋਈ ਹੋਰ ਰਿਪੋਜ਼ਿਟਰੀ ਪ੍ਰਭਾਵਿਤ ਨਹੀਂ ਹੁੰਦੀ।

source: Removes %lld recorded runs for this repository. Log files on disk are not deleted, and no other repository is affected.
hi: इस रिपॉज़िटरी के %lld दर्ज रन हटाता है। डिस्क पर लॉग फ़ाइलें नहीं हटतीं, और कोई अन्य रिपॉज़िटरी प्रभावित नहीं होती।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਲਈ %lld ਦਰਜ ਰਨ ਹਟਾਉਂਦਾ ਹੈ। ਡਿਸਕ ਤੇ ਲੌਗ ਫ਼ਾਈਲਾਂ ਨਹੀਂ ਮਿਟਾਈਆਂ ਜਾਂਦੀਆਂ, ਅਤੇ ਕੋਈ ਹੋਰ ਰਿਪੋਜ਼ਿਟਰੀ ਪ੍ਰਭਾਵਿਤ ਨਹੀਂ ਹੁੰਦੀ।

source: Removes this repository's recorded runs. Log files on disk are kept.
hi: इस रिपॉज़िटरी के दर्ज रन हटाता है। डिस्क पर लॉग फ़ाइलें बनी रहती हैं।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਦੇ ਦਰਜ ਰਨ ਹਟਾਉਂਦਾ ਹੈ। ਡਿਸਕ ਤੇ ਲੌਗ ਫ਼ਾਈਲਾਂ ਬਣੀਆਂ ਰਹਿੰਦੀਆਂ ਹਨ।

source: Repositories
hi: रिपॉज़िटरी
pa: ਰਿਪੋਜ਼ਿਟਰੀਆਂ

source: Repository
hi: रिपॉज़िटरी
pa: ਰਿਪੋਜ਼ਿਟਰੀ

source: Repository names always show; the path under each name is optional.
hi: रिपॉज़िटरी के नाम हमेशा दिखते हैं; हर नाम के नीचे का पथ वैकल्पिक है।
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਦੇ ਨਾਮ ਹਮੇਸ਼ਾ ਦਿੱਖਦੇ ਹਨ; ਹਰ ਨਾਮ ਦੇ ਹੇਠਾਂ ਦਾ ਰਸਤਾ ਵਿਕਲਪਿਕ ਹੈ।

source: Repository Root
hi: रिपॉज़िटरी रूट
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਰੂਟ

source: Repository Scan
hi: रिपॉज़िटरी स्कैन
pa: ਰਿਪੌਜ਼ਟਰੀ ਸਕੈਨ

source: Repository self-identification scan
hi: रिपॉज़िटरी स्व-पहचान स्कैन
pa: ਰਿਪੌਜ਼ਟਰੀ ਸਵੈ-ਪਛਾਣ ਸਕੈਨ

source: Repository Settings
hi: रिपॉज़िटरी सेटिंग्स
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਸੈਟਿੰਗਾਂ

source: Repository Unreachable
hi: रिपॉज़िटरी पहुँच से बाहर
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਪਹੁੰਚ ਤੋਂ ਬਾਹਰ

source: Required
hi: आवश्यक
pa: ਲੋੜੀਂਦਾ

source: Rescan
hi: पुनः स्कैन करें
pa: ਦੁਬਾਰਾ ਸਕੈਨ ਕਰੋ

source: Rescan documents
hi: दस्तावेज़ पुनः स्कैन करें
pa: ਦਸਤਾਵੇਜ਼ ਦੁਬਾਰਾ ਸਕੈਨ ਕਰੋ

source: Reset all preferences to default values.
hi: सभी प्राथमिकताओं को डिफ़ॉल्ट मानों पर रीसेट करें।
pa: ਸਾਰੀਆਂ ਤਰਜੀਹਾਂ ਡਿਫ਼ਾਲਟ ਮੁੱਲਾਂ ਤੇ ਰੀਸੈੱਟ ਕਰੋ।

source: Reset all warnings
hi: सभी चेतावनियाँ रीसेट करें
pa: ਸਾਰੀਆਂ ਚੇਤਾਵਨੀਆਂ ਰੀਸੈੱਟ ਕਰੋ

source: Reset Warnings
hi: चेतावनियाँ रीसेट करें
pa: ਚੇਤਾਵਨੀਆਂ ਰੀਸੈੱਟ ਕਰੋ

source: Resolved build command
hi: हल किया गया बिल्ड कमांड
pa: ਹੱਲ ਕੀਤਾ ਬਿਲਡ ਕਮਾਂਡ

source: Resolved Command
hi: हल किया गया कमांड
pa: ਹੱਲ ਕੀਤਾ ਕਮਾਂਡ

source: Restart to finish switching language
hi: भाषा बदलना पूरा करने के लिए फिर से शुरू करें
pa: ਭਾਸ਼ਾ ਬਦਲਣਾ ਮੁਕੰਮਲ ਕਰਨ ਲਈ ਮੁੜ ਸ਼ੁਰੂ ਕਰੋ

source: Restore All Defaults
hi: सभी डिफ़ॉल्ट पुनर्स्थापित करें
pa: ਸਾਰੇ ਡਿਫ਼ਾਲਟ ਬਹਾਲ ਕਰੋ

source: Restore Defaults
hi: डिफ़ॉल्ट पुनर्स्थापित करें
pa: ਡਿਫ਼ਾਲਟ ਬਹਾਲ ਕਰੋ

source: Restore last opened repository on launch
hi: शुरू होने पर पिछली खुली रिपॉज़िटरी पुनर्स्थापित करें
pa: ਸ਼ੁਰੂ ਹੋਣ ਤੇ ਆਖਰੀ ਖੁੱਲ੍ਹੀ ਰਿਪੋਜ਼ਿਟਰੀ ਬਹਾਲ ਕਰੋ

source: Restore log pane
hi: लॉग पैनल पुनर्स्थापित करें
pa: ਲੌਗ ਪੈਨਲ ਬਹਾਲ ਕਰੋ

source: Restore Log Pane
hi: लॉग पैनल पुनर्स्थापित करें
pa: ਲੌਗ ਪੈਨਲ ਬਹਾਲ ਕਰੋ

source: Retry Scan
hi: स्कैन पुनः प्रयास करें
pa: ਸਕੈਨ ਦੁਬਾਰਾ ਕੋਸ਼ਿਸ਼ ਕਰੋ

source: Reveal document in Finder
hi: दस्तावेज़ Finder में दिखाएँ
pa: ਦਸਤਾਵੇਜ਼ Finder ਵਿੱਚ ਦਿਖਾਓ

source: Reveal in Finder
hi: फ़ाइंडर में दिखाएँ
pa: Finder ਵਿੱਚ ਦਿਖਾਓ

source: Rotate/create a new log when size limit is reached.
hi: आकार सीमा पहुँचने पर नया लॉग बनाएँ।
pa: ਆਕਾਰ ਸੀਮਾ ਪਹੁੰਚਣ ਤੇ ਨਵਾਂ ਲੌਗ ਬਣਾਓ।

source: Round window corners
hi: विंडो के कोने गोल करें
pa: ਵਿੰਡੋ ਦੇ ਕੋਨੇ ਗੋਲ ਕਰੋ

source: Run
hi: चलाएँ
pa: ਚਲਾਓ

source: Run %@
hi: %@ चलाएँ
pa: %@ ਚਲਾਓ

source: Run a build to see live output and saved logs here.
hi: यहाँ लाइव आउटपुट और सहेजे गए लॉग देखने के लिए कोई बिल्ड चलाएँ।
pa: ਇੱਥੇ ਲਾਈਵ ਆਉਟਪੁੱਟ ਅਤੇ ਸੇਵ ਕੀਤੇ ਲੌਗ ਦੇਖਣ ਲਈ ਕੋਈ ਬਿਲਡ ਚਲਾਓ।

source: Run Build
hi: बिल्ड चलाएँ
pa: ਬਿਲਡ ਚਲਾਓ

source: Runs the selected build with the displayed parameter values.
hi: दिखाए गए पैरामीटर मानों के साथ चयनित बिल्ड चलाता है।
pa: ਦਿਖਾਏ ਗਏ ਪੈਰਾਮੀਟਰ ਮੁੱਲਾਂ ਨਾਲ ਚੁਣੀ ਬਿਲਡ ਚਲਾਉਂਦਾ ਹੈ।

source: Runs this build script.
hi: यह बिल्ड स्क्रिप्ट चलाता है।
pa: ਇਹ ਬਿਲਡ ਸਕ੍ਰਿਪਟ ਚਲਾਉਂਦਾ ਹੈ।

source: Save
hi: सहेजें
pa: ਸੇਵ ਕਰੋ

source: Save build logs to disk automatically
hi: बिल्ड लॉग डिस्क पर स्वतः सहेजें
pa: ਬਿਲਡ ਲੌਗ ਡਿਸਕ ਤੇ ਆਟੋਮੈਟਿਕ ਸੇਵ ਕਰੋ

source: Save Build Manager diagnostics to disk.
hi: बिल्ड मैनेजर के निदान डिस्क पर सहेजें।
pa: ਬਿਲਡ ਮੈਨੇਜਰ ਡਾਇਗਨੌਸਟਿਕ ਡਿਸਕ ਤੇ ਸੇਵ ਕਰੋ।

source: Save document
hi: दस्तावेज़ सहेजें
pa: ਦਸਤਾਵੇਜ਼ ਸੇਵ ਕਰੋ

source: Save Log
hi: लॉग सहेजें
pa: ਲੌਗ ਸੇਵ ਕਰੋ

source: Save log file after a build completes.
hi: बिल्ड पूरा होने पर लॉग फ़ाइल सहेजें।
pa: ਬਿਲਡ ਮੁਕੰਮਲ ਹੋਣ ਤੋਂ ਬਾਅਦ ਲੌਗ ਫ਼ਾਈਲ ਸੇਵ ਕਰੋ।

source: Save Log to file
hi: लॉग फ़ाइल में सहेजें
pa: ਲੌਗ ਫ਼ਾਈਲ ਵਿੱਚ ਸੇਵ ਕਰੋ

source: Saved log
hi: सहेजा गया लॉग
pa: ਸੇਵ ਕੀਤਾ ਲੌਗ

source: Scan complete
hi: स्कैन पूर्ण
pa: ਸਕੈਨ ਪੂਰਾ ਹੋਇਆ

source: Scan Now
hi: अब स्कैन करें
pa: ਹੁਣੇ ਸਕੈਨ ਕਰੋ

source: Scan Repo
hi: रेपो स्कैन करें
pa: ਰੇਪੋ ਸਕੈਨ ਕਰੋ

source: Scan repository
hi: रिपॉज़िटरी स्कैन करें
pa: ਰਿਪੌਜ਼ਟਰੀ ਸਕੈਨ ਕਰੋ

source: Scan Repository?
hi: रिपॉज़िटरी स्कैन करें?
pa: ਰਿਪੌਜ਼ਟਰੀ ਸਕੈਨ ਕਰੋ?

source: Scan subdirectories for /build folders
hi: /build फ़ोल्डरों के लिए उप-डायरेक्टरी स्कैन करें
pa: /build ਫ਼ੋਲਡਰਾਂ ਲਈ ਉਪ-ਡਾਇਰੈਕਟਰੀਆਂ ਸਕੈਨ ਕਰੋ

source: Scanning Build Scripts
hi: बिल्ड स्क्रिप्ट स्कैन हो रही हैं
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਸਕੈਨ ਹੋ ਰਹੀਆਂ ਹਨ

source: Scanning repository contents
hi: रिपॉज़िटरी सामग्री स्कैन हो रही है
pa: ਰਿਪੌਜ਼ਟਰੀ ਸਮੱਗਰੀ ਸਕੈਨ ਹੋ ਰਹੀ ਹੈ

source: Script
hi: स्क्रिप्ट
pa: ਸਕ੍ਰਿਪਟ

source: Scripts
hi: स्क्रिप्ट
pa: ਸਕ੍ਰਿਪਟਾਂ

source: Scripts directory (inside /build)
hi: स्क्रिप्ट डायरेक्टरी (/build के अंदर)
pa: ਸਕ੍ਰਿਪਟ ਡਾਇਰੈਕਟਰੀ (/build ਦੇ ਅੰਦਰ)

source: Search Again
hi: फिर से खोजें
pa: ਦੁਬਾਰਾ ਖੋਜੋ

source: Search every folder in this repository for shell scripts.
hi: इस रिपॉज़िटरी के हर फ़ोल्डर में शेल स्क्रिप्ट खोजें।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਦੇ ਹਰ ਫ਼ੋਲਡਰ ਵਿੱਚ ਸ਼ੈੱਲ ਸਕ੍ਰਿਪਟਾਂ ਲੱਭੋ।

source: Search is case sensitive
hi: खोज केस-संवेदी है
pa: ਖੋਜ ਕੇਸ-ਸੰਵੇਦਨਸ਼ੀਲ ਹੈ

source: Search log
hi: लॉग खोजें
pa: ਲੌਗ ਖੋਜੋ

source: Search log…
hi: लॉग खोजें…
pa: ਲੌਗ ਖੋਜੋ…

source: Searches every folder in this repository for .sh files.
hi: इस रिपॉज़िटरी के हर फ़ोल्डर में .sh फ़ाइलें खोजता है।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਦੇ ਹਰ ਫ਼ੋਲਡਰ ਵਿੱਚ .sh ਫ਼ਾਈਲਾਂ ਲੱਭਦਾ ਹੈ।

source: Searching the repository…
hi: रिपॉज़िटरी खोजी जा रही है…
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਖੋਜੀ ਜਾ ਰਹੀ ਹੈ…

source: Select
hi: चुनें
pa: ਚੁਣੋ

source: Select a Document
hi: कोई दस्तावेज़ चुनें
pa: ਕੋਈ ਦਸਤਾਵੇਜ਼ ਚੁਣੋ

source: Select a Repository
hi: कोई रिपॉज़िटरी चुनें
pa: ਕੋਈ ਰਿਪੋਜ਼ਿਟਰੀ ਚੁਣੋ

source: Select recent repository %@
hi: हाल की रिपॉज़िटरी %@ चुनें
pa: ਤਾਜ਼ਾ ਰਿਪੋਜ਼ਿਟਰੀ %@ ਚੁਣੋ

source: Select repository %@
hi: रिपॉज़िटरी %@ चुनें
pa: ਰਿਪੋਜ਼ਿਟਰੀ %@ ਚੁਣੋ

source: Select this script to review parameters and command preview.
hi: पैरामीटर और कमांड पूर्वावलोकन देखने के लिए यह स्क्रिप्ट चुनें।
pa: ਪੈਰਾਮੀਟਰ ਅਤੇ ਕਮਾਂਡ ਪ੍ਰੀਵਿਊ ਦੇਖਣ ਲਈ ਇਹ ਸਕ੍ਰਿਪਟ ਚੁਣੋ।

source: Select which tab to show when Build Manager starts.
hi: चुनें कि बिल्ड मैनेजर शुरू होने पर कौन-सा टैब दिखे।
pa: ਚੁਣੋ ਕਿ ਬਿਲਡ ਮੈਨੇਜਰ ਸ਼ੁਰੂ ਹੋਣ ਤੇ ਕਿਹੜਾ ਟੈਬ ਦਿੱਖੇ।

source: Selected
hi: चयनित
pa: ਚੁਣਿਆ

source: Selected Script
hi: चयनित स्क्रिप्ट
pa: ਚੁਣੀ ਸਕ੍ਰਿਪਟ

source: Self-identify build scripts, saved logs, and Markdown documents before opening the workspace.
hi: कार्यक्षेत्र खोलने से पहले बिल्ड स्क्रिप्ट, सहेजे गए लॉग और मार्कडाउन दस्तावेज़ों की स्वयं पहचान करें।
pa: ਵਰਕਸਪੇਸ ਖੋਲ੍ਹਣ ਤੋਂ ਪਹਿਲਾਂ ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ, ਸੁਰੱਖਿਅਤ ਕੀਤੇ ਲੌਗ ਅਤੇ ਮਾਰਕਡਾਊਨ ਦਸਤਾਵੇਜ਼ਾਂ ਦੀ ਸਵੈ-ਪਛਾਣ ਕਰੋ।

source: Set a global timeout for all builds.
hi: सभी बिल्ड के लिए वैश्विक समय-सीमा तय करें।
pa: ਸਾਰੀਆਂ ਬਿਲਡਾਂ ਲਈ ਵਿਸ਼ਵ-ਵਿਆਪੀ ਟਾਈਮਆਉਟ ਸੈੱਟ ਕਰੋ।

source: Set default environment variables for all builds.
hi: सभी बिल्ड के लिए डिफ़ॉल्ट एनवायरनमेंट वेरिएबल तय करें।
pa: ਸਾਰੀਆਂ ਬਿਲਡਾਂ ਲਈ ਡਿਫ਼ਾਲਟ ਵਾਤਾਵਰਣ ਵੇਰੀਏਬਲ ਸੈੱਟ ਕਰੋ।

source: Settings
hi: सेटिंग्स
pa: ਸੈਟਿੰਗਾਂ

source: Shell used to run build scripts.
hi: बिल्ड स्क्रिप्ट चलाने के लिए उपयोग होने वाला शेल।
pa: ਬਿਲਡ ਸਕ੍ਰਿਪਟਾਂ ਚਲਾਉਣ ਲਈ ਵਰਤਿਆ ਸ਼ੈੱਲ।

source: Show animations
hi: एनिमेशन दिखाएँ
pa: ਐਨੀਮੇਸ਼ਨ ਦਿਖਾਓ

source: Show Detail View
hi: विवरण दृश्य दिखाएँ
pa: ਵੇਰਵਾ ਦ੍ਰਿਸ਼ ਦਿਖਾਓ

source: Show Detail View Window (Right Side)
hi: विवरण विंडो दिखाएँ (दाईं ओर)
pa: ਵੇਰਵਾ ਵਿੰਡੋ ਦਿਖਾਓ (ਸੱਜੇ ਪਾਸੇ)

source: Show line numbers
hi: पंक्ति संख्याएँ दिखाएँ
pa: ਲਾਈਨ ਨੰਬਰ ਦਿਖਾਓ

source: Show line numbers in log viewer.
hi: लॉग व्यूअर में पंक्ति संख्याएँ दिखाएँ।
pa: ਲੌਗ ਵਿਊਅਰ ਵਿੱਚ ਲਾਈਨ ਨੰਬਰ ਦਿਖਾਓ।

source: Show notification duration
hi: सूचना की अवधि दिखाएँ
pa: ਸੂਚਨਾ ਦੀ ਮਿਆਦ ਦਿਖਾਓ

source: Show notifications for build events.
hi: बिल्ड घटनाओं की सूचनाएँ दिखाएँ।
pa: ਬਿਲਡ ਘਟਨਾਵਾਂ ਦੀਆਂ ਸੂਚਨਾਵਾਂ ਦਿਖਾਓ।

source: Show Repo Window (Left side)
hi: रिपॉज़िटरी विंडो दिखाएँ (बाईं ओर)
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਵਿੰਡੋ ਦਿਖਾਓ (ਖੱਬੇ ਪਾਸੇ)

source: Show repository paths
hi: रिपॉज़िटरी पथ दिखाएँ
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਰਸਤੇ ਦਿਖਾਓ

source: Show repository paths in the sidebar
hi: साइडबार में रिपॉज़िटरी पथ दिखाएँ
pa: ਸਾਈਡਬਾਰ ਵਿੱਚ ਰਿਪੋਜ਼ਿਟਰੀ ਰਸਤੇ ਦਿਖਾਓ

source: Show Sidebar
hi: साइडबार दिखाएँ
pa: ਸਾਈਡਬਾਰ ਦਿਖਾਓ

source: Show Status Bar (Bottom)
hi: स्टेटस बार दिखाएँ (नीचे)
pa: ਸਟੇਟਸ ਬਾਰ ਦਿਖਾਓ (ਹੇਠਾਂ)

source: Show the repository sidebar
hi: रिपॉज़िटरी साइडबार दिखाएँ
pa: ਰਿਪੋਜ਼ਿਟਰੀ ਸਾਈਡਬਾਰ ਦਿਖਾਓ

source: Show the right panel
hi: दायाँ पैनल दिखाएँ
pa: ਸੱਜਾ ਪੈਨਲ ਦਿਖਾਓ

source: Sidebar Width
hi: साइडबार चौड़ाई
pa: ਸਾਈਡਬਾਰ ਚੌੜਾਈ

source: Skip
hi: छोड़ें
pa: ਛੱਡੋ

source: Source
hi: स्रोत
pa: ਸਰੋਤ

source: Space between lines in the console.
hi: कंसोल में पंक्तियों के बीच का अंतर।
pa: ਕੰਸੋਲ ਵਿੱਚ ਲਾਈਨਾਂ ਵਿਚਕਾਰ ਦੀ ਥਾਂ।

source: Stable (Recommended)
hi: स्थिर (अनुशंसित)
pa: ਸਥਿਰ (ਸਿਫ਼ਾਰਿਸ਼ੀ)

source: Stable skips prereleases. Beta includes them.
hi: स्थिर चैनल प्री-रिलीज़ छोड़ता है। बीटा उन्हें शामिल करता है।
pa: ਸਥਿਰ ਚੈਨਲ ਪ੍ਰੀ-ਰਿਲੀਜ਼ ਛੱਡਦਾ ਹੈ। ਬੀਟਾ ਉਨ੍ਹਾਂ ਨੂੰ ਸ਼ਾਮਲ ਕਰਦਾ ਹੈ।

source: Stale
hi: बासी
pa: ਪੁਰਾਣਾ

source: Standard
hi: मानक
pa: ਮਿਆਰੀ

source: Standard error
hi: मानक त्रुटि
pa: ਮਿਆਰੀ ਗਲਤੀ

source: Standard folder
hi: मानक फ़ोल्डर
pa: ਮਿਆਰੀ ਫ਼ੋਲਡਰ

source: Started At
hi: शुरू हुआ
pa: ਸ਼ੁਰੂ ਹੋਇਆ

source: Starting…
hi: शुरू हो रहा है…
pa: ਸ਼ੁਰੂ ਹੋ ਰਿਹਾ ਹੈ…

source: Statistics
hi: आँकड़े
pa: ਅੰਕੜੇ

source: Statistics date range
hi: आँकड़ों की तिथि सीमा
pa: ਅੰਕੜਿਆਂ ਦੀ ਮਿਤੀ ਸੀਮਾ

source: Stay on Output
hi: आउटपुट पर बने रहें
pa: ਆਉਟਪੁੱਟ ਤੇ ਰਹੋ

source: Stop
hi: रोकें
pa: ਰੋਕੋ

source: Stop %@
hi: %@ रोकें
pa: %@ ਰੋਕੋ

source: Stop Build
hi: बिल्ड रोकें
pa: ਬਿਲਡ ਰੋਕੋ

source: Stops the active build process.
hi: सक्रिय बिल्ड प्रक्रिया को रोकता है।
pa: ਸਰਗਰਮ ਬਿਲਡ ਪ੍ਰਕਿਰਿਆ ਰੋਕਦਾ ਹੈ।

source: Store recently opened repositories for quick access.
hi: त्वरित पहुँच के लिए हाल में खोली गई रिपॉज़िटरी रखें।
pa: ਤੁਰੰਤ ਪਹੁੰਚ ਲਈ ਤਾਜ਼ਾ ਖੋਲ੍ਹੀਆਂ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਰੱਖੋ।

source: Streaming output from the running build
hi: चल रहे बिल्ड से आ रहा आउटपुट
pa: ਚੱਲਦੀ ਬਿਲਡ ਤੋਂ ਆ ਰਿਹਾ ਆਉਟਪੁੱਟ

source: Success Rate
hi: सफलता दर
pa: ਸਫਲਤਾ ਦਰ

source: Switch to History
hi: इतिहास पर जाएँ
pa: ਇਤਿਹਾਸ ਤੇ ਜਾਓ

source: System
hi: सिस्टम
pa: ਸਿਸਟਮ

source: Terminate child processes on Stop
hi: रोकने पर चाइल्ड प्रोसेस समाप्त करें
pa: ਰੋਕਣ ਤੇ ਚਾਈਲਡ ਪ੍ਰੋਸੈੱਸਾਂ ਖਤਮ ਕਰੋ

source: Terminate process tree on Stop
hi: रोकने पर पूरा प्रोसेस ट्री समाप्त करें
pa: ਰੋਕਣ ਤੇ ਪੂਰਾ ਪ੍ਰੋਸੈੱਸ ਟ੍ਰੀ ਖਤਮ ਕਰੋ

source: Text Size (%)
hi: पाठ आकार (%)
pa: ਲਿਖਾਈ ਆਕਾਰ (%)

source: Theme
hi: थीम
pa: ਥੀਮ

source: This only removes it from the app's list. The folder, its scripts, and its logs are left untouched on disk, and its build history is kept.
hi: यह केवल ऐप की सूची से हटाता है। फ़ोल्डर, उसकी स्क्रिप्ट और उसके लॉग डिस्क पर अछूते रहते हैं, और उसका बिल्ड इतिहास बना रहता है।
pa: ਇਹ ਸਿਰਫ਼ ਐਪ ਦੀ ਸੂਚੀ ਤੋਂ ਹਟਾਉਂਦਾ ਹੈ। ਫ਼ੋਲਡਰ, ਉਸ ਦੀਆਂ ਸਕ੍ਰਿਪਟਾਂ ਅਤੇ ਲੌਗ ਡਿਸਕ ਤੇ ਅਛੂਹੇ ਰਹਿੰਦੇ ਹਨ, ਅਤੇ ਉਸ ਦਾ ਬਿਲਡ ਇਤਿਹਾਸ ਬਣਿਆ ਰਹਿੰਦਾ ਹੈ।

source: This removes all recorded build history from this machine. Log files on disk are not deleted.
hi: यह इस मशीन से सारा दर्ज बिल्ड इतिहास हटा देता है। डिस्क पर लॉग फ़ाइलें नहीं हटाई जातीं।
pa: ਇਹ ਇਸ ਮਸ਼ੀਨ ਤੋਂ ਸਾਰਾ ਦਰਜ ਬਿਲਡ ਇਤਿਹਾਸ ਹਟਾ ਦਿੰਦਾ ਹੈ। ਡਿਸਕ ਤੇ ਲੌਗ ਫ਼ਾਈਲਾਂ ਨਹੀਂ ਮਿਟਾਈਆਂ ਜਾਂਦੀਆਂ।

source: This repository doesn't have a /build folder at its root.
hi: इस रिपॉज़िटरी के रूट में /build फ़ोल्डर नहीं है।
pa: ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਦੇ ਰੂਟ ਵਿੱਚ /build ਫ਼ੋਲਡਰ ਨਹੀਂ ਹੈ।

source: This repository has no .md files outside build and dependency folders.
hi: बिल्ड और डिपेंडेंसी फ़ोल्डरों के बाहर इस रिपॉज़िटरी में कोई .md फ़ाइल नहीं है।
pa: ਬਿਲਡ ਅਤੇ ਡਿਪੈਂਡੈਂਸੀ ਫ਼ੋਲਡਰਾਂ ਤੋਂ ਬਾਹਰ ਇਸ ਰਿਪੋਜ਼ਿਟਰੀ ਵਿੱਚ ਕੋਈ .md ਫ਼ਾਈਲ ਨਹੀਂ ਹੈ।

source: This script does not declare parameters. It will run directly from the repository root.
hi: यह स्क्रिप्ट कोई पैरामीटर घोषित नहीं करती। यह सीधे रिपॉज़िटरी रूट से चलेगी।
pa: ਇਹ ਸਕ੍ਰਿਪਟ ਕੋਈ ਪੈਰਾਮੀਟਰ ਐਲਾਨ ਨਹੀਂ ਕਰਦੀ। ਇਹ ਸਿੱਧੇ ਰਿਪੋਜ਼ਿਟਰੀ ਰੂਟ ਤੋਂ ਚੱਲੇਗੀ।

source: Timestamp format
hi: समय-मुहर प्रारूप
pa: ਸਮੇਂ-ਮੋਹਰ ਫ਼ਾਰਮੈਟ

source: Toggle Detail View
hi: विवरण दृश्य टॉगल करें
pa: ਵੇਰਵਾ ਦ੍ਰਿਸ਼ ਟੌਗਲ ਕਰੋ

source: Total Builds
hi: कुल बिल्ड
pa: ਕੁੱਲ ਬਿਲਡਾਂ

source: Treat files with exec permission as runnable scripts.
hi: निष्पादन अनुमति वाली फ़ाइलों को चलाने योग्य स्क्रिप्ट मानें।
pa: ਐਗਜ਼ੈਕਿਊਟ ਅਨੁਮਤੀ ਵਾਲੀਆਂ ਫ਼ਾਈਲਾਂ ਨੂੰ ਚਲਾਉਣਯੋਗ ਸਕ੍ਰਿਪਟਾਂ ਮੰਨੋ।

source: Turn this off to read earlier output without following new lines.
hi: नई पंक्तियों के पीछे भागे बिना पुराना आउटपुट पढ़ने के लिए इसे बंद करें।
pa: ਨਵੀਆਂ ਲਾਈਨਾਂ ਦੇ ਪਿੱਛੇ ਜਾਏ ਬਿਨਾਂ ਪੁਰਾਣਾ ਆਉਟਪੁੱਟ ਪੜ੍ਹਨ ਲਈ ਇਸ ਨੂੰ ਬੰਦ ਕਰੋ।

source: UI Density
hi: UI घनत्व
pa: UI ਘਣਤਾ

source: Unavailable
hi: अनुपलब्ध
pa: ਅਣਉਪਲਬਧ

source: Unavailable: this script cannot run right now.
hi: अनुपलब्ध: यह स्क्रिप्ट अभी नहीं चल सकती।
pa: ਅਣਉਪਲਬਧ: ਇਹ ਸਕ੍ਰਿਪਟ ਹੁਣੇ ਨਹੀਂ ਚੱਲ ਸਕਦੀ।

source: Unpin
hi: पिन हटाएँ
pa: ਪਿੰਨ ਹਟਾਓ

source: Unreachable
hi: पहुँच से बाहर
pa: ਪਹੁੰਚ ਤੋਂ ਬਾਹਰ

source: Update channel
hi: अपडेट चैनल
pa: ਅਪਡੇਟ ਚੈਨਲ

source: Updates
hi: अपडेट
pa: ਅਪਡੇਟ

source: Use macOS system font for a native look.
hi: नेटिव रूप के लिए macOS सिस्टम फ़ॉन्ट उपयोग करें।
pa: ਦੇਸੀ ਰੂਪ ਲਈ macOS ਸਿਸਟਮ ਫ਼ੌਂਟ ਵਰਤੋ।

source: Use rounded corners for windows and panels.
hi: विंडो और पैनल के लिए गोल कोने उपयोग करें।
pa: ਵਿੰਡੋਜ਼ ਅਤੇ ਪੈਨਲਾਂ ਲਈ ਗੋਲ ਕੋਨੇ ਵਰਤੋ।

source: Use system font (San Francisco)
hi: सिस्टम फ़ॉन्ट उपयोग करें (San Francisco)
pa: ਸਿਸਟਮ ਫ਼ੌਂਟ ਵਰਤੋ (San Francisco)

source: Used to fetch private repositories and metadata.
hi: निजी रिपॉज़िटरी और मेटाडेटा लाने के लिए उपयोग होता है।
pa: ਨਿੱਜੀ ਰਿਪੋਜ਼ਿਟਰੀਆਂ ਅਤੇ ਮੈਟਾਡੇਟਾ ਲਿਆਉਣ ਲਈ ਵਰਤਿਆ ਜਾਂਦਾ ਹੈ।

source: Validation error: %@
hi: मान्यता त्रुटि: %@
pa: ਪੁਸ਼ਟੀ ਗਲਤੀ: %@

source: Verbose / Debug logging
hi: विस्तृत / डिबग लॉगिंग
pa: ਵਿਸਤਾਰਿਤ / ਡੀਬੱਗ ਲੌਗਿੰਗ

source: View All
hi: सभी देखें
pa: ਸਭ ਦੇਖੋ

source: Waiting for build output…
hi: बिल्ड आउटपुट की प्रतीक्षा…
pa: ਬਿਲਡ ਆਉਟਪੁੱਟ ਦੀ ਉਡੀਕ…

source: Warn me at 10%
hi: 10% पर चेतावनी दें
pa: 10% ਤੇ ਚੇਤਾਵਨੀ ਦਿਓ

source: Warn me at 20%
hi: 20% पर चेतावनी दें
pa: 20% ਤੇ ਚੇਤਾਵਨੀ ਦਿਓ

source: Warn when API rate limit is low.
hi: API दर-सीमा कम होने पर चेतावनी दें।
pa: API ਰੇਟ ਸੀਮਾ ਘੱਟ ਹੋਣ ਤੇ ਚੇਤਾਵਨੀ ਦਿਓ।

source: Warnings
hi: चेतावनियाँ
pa: ਚੇਤਾਵਨੀਆਂ

source: What to do when a build finishes.
hi: बिल्ड समाप्त होने पर क्या करें।
pa: ਬਿਲਡ ਖਤਮ ਹੋਣ ਤੇ ਕੀ ਕਰਨਾ ਹੈ।

source: When opening a folder, automatically look for a /build directory.
hi: फ़ोल्डर खोलते समय स्वतः /build डायरेक्टरी खोजें।
pa: ਫ਼ੋਲਡਰ ਖੋਲ੍ਹਣ ਵੇਲੇ ਆਟੋਮੈਟਿਕ /build ਡਾਇਰੈਕਟਰੀ ਲੱਭੋ।

source: Wide (340px)
hi: चौड़ा (340px)
pa: ਚੌੜਾ (340px)

source: Word wrap
hi: शब्द लपेटें
pa: ਸ਼ਬਦ ਲਪੇਟਣਾ

source: Working directory
hi: कार्य डायरेक्टरी
pa: ਕੰਮ ਦੀ ਡਾਇਰੈਕਟਰੀ

source: Wrap long lines in the console and log viewer.
hi: कंसोल और लॉग व्यूअर में लंबी पंक्तियाँ लपेटें।
pa: ਕੰਸੋਲ ਅਤੇ ਲੌਗ ਵਿਊਅਰ ਵਿੱਚ ਲੰਬੀਆਂ ਲਾਈਨਾਂ ਲਪੇਟੋ।
